In [2]:
# Importing pandas
import pandas as pd

# Reading CSV file containing data into a Dataframe
bank_loans = pd.read_csv("raw_data/Bank_Personal_Loan_Modelling.csv")

# Displays first few rows of dataframe to show column names
bank_loans.head()

,ID,Age,Experience,Income,ZIP Code,Family,CCAvg,Education,Mortgage,Personal Loan,Securities Account,CD Account,Online,CreditCard
0,1,25,1,49,91107,4,1.6,1,0,0,1,0,0,0
1,2,45,19,34,90089,3,1.5,1,0,0,1,0,0,0
2,3,39,15,11,94720,1,1.0,1,0,0,0,0,0,0
3,4,35,9,100,94112,1,2.7,2,0,0,0,0,0,0
4,5,35,8,45,91330,4,1.0,2,0,0,0,0,0,1

In [4]:
# Narrowing columns in the data frame for our use (can be adjusted if need be)
bank_loans = bank_loans[['Age', 'Experience', 'Income', 'ZIP Code', 'Family', 'CCAvg',
                         'Education', 'Mortgage', 'Personal Loan']]

# Displaying reduced dataframe
bank_loans.head()

,Age,Experience,Income,ZIP Code,Family,CCAvg,Education,Mortgage,Personal Loan
0,25,1,49,91107,4,1.6,1,0,0
1,45,19,34,90089,3,1.5,1,0,0
2,39,15,11,94720,1,1.0,1,0,0
3,35,9,100,94112,1,2.7,2,0,0
4,35,8,45,91330,4,1.0,2,0,0

TypeError: 'Series' object is not callable